<?php

include "vendor/autoload.php";

use AP\Clues\Data;
use AP\Clues\Mask;
use AP\Clues\Uncrypter;

$data = new Data("
ОКЛРЫЧПЗЙ
БИОИШКТИН
АРУЖЛУМЪЭ
ЛКОЛИЖЗБМ
ФУИОАСЕРУ
ЧТЕИАЮИЮЛ
АРКЦНОКБЮ
КАОЖСЫЛСТ
ИСЕДЯЕОБЕ
ВСДИЕИЛДМ
РОЕЖДЕТШИ
ГЯФТВЬОПА
ЕНОМЖЕИБО
СЛДИАТЙАК
");


$mask1 = new Mask("
______П__
_________
_________
_________
_________
__Е______
_Р_______
_______С_
_____Е___
_________
_________
__Ф___О__
_Н_______
_______А_
");


$mask2 = new Mask("
_________
______Т__
___Ж_____
__О______
_______Р_
Ч________
_____О___
___Ж_____
_С_______
_________
_________
_________
__О______
_________
");

Uncrypter::renderAllIfAllHolesHaveSymbols($data, $mask2);


