<?php

include "vendor/autoload.php";

use AP\Clues\Data;
use AP\Clues\Mask;
use AP\Clues\Uncrypter;

$data = new Data("
ОКЛРЫЧПЗЙ
БИОИШКТИН
АРУЖЛУМЪЭ
ЛКОЛИЖЗБМ
ФУИОАСЕРУ
ЧТЕИАЮИЮЛ
АРКЦНОКБЮ
КАОЖСЫЛСТ
ИСЕДЯЕОБЕ
ВСДИЕИЛДМ
РОЕЖДЕТШИ
ГЯФТВЬОПА
ЕНОМЖЕИБО
СЛДИАТЙАК
");


$mask1 = new Mask("
______O__
_________
_________
_________
_________
__O______
_O_______
_______O_
_____O___
_________
_________
__O___O__
_O_______
_______O_
");


$mask2 = new Mask("
_________
______O__
___O_____
__O______
_______O_
O________
_____O___
___O_____
_O_______
_________
_________
_________
__O______
_________
");

Uncrypter::renderAllIfAllHolesHaveSymbols($data, $mask2);


